[
    {
        "name": "Ability Steal",
        "description": "Protagonist can steal, absorb, or copy others abilities. Imagine getting NTRed by your unique ability that should've been yours alone and some random black haired kpop idol looking like dude stole it. That sucks"
    },
    {
        "name": "Academy",
        "description": "Stories focusing inside an Academy, typically in a fantasy world or modern futuristic world. Surely these top-tier and world-class Academies won't get invaded by a criminal or villain organization during a festival, right?"
    },
    {
        "name": "Afterlife",
        "description": "Stories focusing on the concept of life after death or the existence of an afterlife. This is the Sequel to Life so I'd suggest learning about this topic first before you get reincarnated inside a novel as a 3rd-rate villain who is used as a stepping stone by the protagonist early on the story"
    },
    {
        "name": "Angst",
        "description": "Themes of emotional struggle, often featuring deep personal conflict. I love to imagine myself in a situation where it's always me as miserable during bed time"
    },
    {
        "name": "Anthology",
        "description": "Collections of short, unrelated stories, often across various genres, in one volume. It's like gathering orphans inside a small house and letting them play and run around before being groomed as assassins"
    },
    {
        "name": "Apocalypse",
        "description": "Stories set during the possible end of the world or civilization. God will make this happen if gen z keeps using :skull emoji: on every single post or comment they put on the internet"
    },
    {
        "name": "Business",
        "description": "Stories involving the business world, finance, or entrepreneurial ventures."
    },
    {
        "name": "Child Protagonist",
        "description": "Stories where the protagonist is a child or a young teen."
    },
    {
        "name": "Coming of Age",
        "description": "Stories focusing on the growth and development of young characters into adulthood. This is the phase where you start to realize that Japan and South Korea is different from anime and k-drama"
    },
    {
        "name": "Cooking",
        "description": "Stories centered around the preparation of food and cooking. Just like what Sun Tzu said in his book The Art of War and I quote \"Hold up, let him cook\". He said that. I was there"
    },
    {
        "name": "Corporate",
        "description": "Involves a corporate or business setting, often with power dynamics. Why is the printer not working again?"
    },
    {
        "name": "Crime",
        "description": "Involves illegal activities, investigations, or criminal organizations. But these doesn't compare to what your incognito mode have seen over the years you had been together"
    },
    {
        "name": "Dark Fantasy",
        "description": "Fantasy but with a darker, more mature, or grim themes."
    },
    {
        "name": "Delinquents",
        "description": "Focuses on rebellious or troubled youths accompanied with bullying, often in school settings. Bruh I swear to God these highschoolers looks like fking war veterans who was raised as a killing weapon as a child with those ridiculously physique and strength"
    },
    {
        "name": "Dungeon/Tower",
        "description": "One day, they suddenly appeared disrupting the peace and commonsense of humanity. Death, taxes, and Dungeon and Tower."
    },
    {
        "name": "Entertainment Industry",
        "description": "Stories centered around the entertainment business (e.g., acting, idols etc). Kpop stans after realizing that their idols are human beings who wants to date and not get collared as if their lives belongs to these lunatics"
    },
    {
        "name": "Evil/Villain/Anti-Hero",
        "description": "Protagonist is either morally ambiguous, antagonistic, or a straight-up villain. This is the time when you realize that the world is not only white and black"
    },
    {
        "name": "Female Protagonist",
        "description": "Protagonist is female driving the story. For my XX chromosomes homies out there"
    },
    {
        "name": "Fiction Becomes Reality",
        "description": "Fiction becomes real or they mix with reality, often from a game or novel. And no, your waifu isn't real and they certainly don't want you to lick their feets or smell their armpits"
    },
    {
        "name": "Friendship",
        "description": "Stories about building and maintaining strong bonds and friendship between characters. If you did something stupid because you're a dummy and your friend laughs while taking photos of videos first before helping you, that's a real one"
    },
    {
        "name": "Game",
        "description": "Stories that revolve around games, commonly inside a VR or any E-Sports game. This category is straight up boring, looking at you, VR"
    },
    {
        "name": "Hiding True Identity/Strength",
        "description": "Protagonist conceal their true identity and/or strength from others for reasons. It pisses me off so much when the MC hides his strength for reasons that doesn't even make sense"
    },
    {
        "name": "Isekai",
        "description": "Protagonist is transported to a different world, often with a new identity or powers. If Japan have truck-kun to deliver these bums on a different world, then South Korea have being transported into a different world because you made a 5,700 characters comment in a game or novel on how bad it is"
    },
    {
        "name": "Kingdom Building",
        "description": "Stories focusing on creating, expanding, and advancing a kingdom, empire, or civilization. We went from monke to :skull emoji:. What a downgrade. Charles Darwin would not be proud"
    },
    {
        "name": "Law",
        "description": "Deals with legal matters, such as court cases or lawyers."
    },
    {
        "name": "Leadership",
        "description": "Protagonist is the leader of a group, clan, sect etc. equipped with leadership skills. Or maybe not the skills"
    },
    {
        "name": "Medical",
        "description": "Stories centered around healthcare, doctors, or medical settings."
    },
    {
        "name": "Medieval",
        "description": "Set in a time period resembling medieval fantasy or feudal society. How dare a commoner breathe the same air as I do? Seeking death"
    },
    {
        "name": "Mentor",
        "description": "Protagonist is a teacher, mentor, or a master of someone or some characters within the story."
    },
    {
        "name": "Misunderstanding",
        "description": "Protagonist gets misunderstood, either for comedic effect, plot progression or relevance."
    },
    {
        "name": "Modern World Cheat",
        "description": "Protagonist has a cheat-like ability or skill in the modern world that no one else have because of course , why not?"
    },
    {
        "name": "Multiple Protagonist",
        "description": "Features a narrative with more than one Protagonist driving the story."
    },
    {
        "name": "Murim",
        "description": "Martial arts-centered world often rooted in Korean history or fantasy."
    },
    {
        "name": "Music",
        "description": "Stories involving music, musical instruments, or the music industry. If only I can hear those music"
    },
    {
        "name": "Mythology",
        "description": "Stories involving mythological creatures or gods from various cultures."
    },
    {
        "name": "Necromancy",
        "description": "Protagonist is a necromancer or has necromancer-like skills. Bonus point if the protagonist has sperm eyes"
    },
    {
        "name": "Non-Human",
        "description": "Protagonist is not a human. Half-humans does not fall here."
    },
    {
        "name": "Overpowered Protagonist",
        "description": "Protagonist is already considered strong from the start."
    },
    {
        "name": "Philosophical",
        "description": "Stories focusing on deep philosophical discussions or themes. This is the embodiment of your shower thoughts"
    },
    {
        "name": "Politics",
        "description": "Involves political systems, power struggles, schemes and manipulations etc."
    },
    {
        "name": "Post-Apocalyptic",
        "description": "Stories taking place after the collapse or aftermath of a fallen civilization."
    },
    {
        "name": "Rags to Riches",
        "description": "Protagonist rises from poverty to wealth and success."
    },
    {
        "name": "Regression",
        "description": "Protagonist gets another chance and goes back in the past."
    },
    {
        "name": "Reincarnation",
        "description": "Protagonist is reincarnated in another body or world."
    },
    {
        "name": "Returnee",
        "description": "Protagonist returns from a different world, dimension, or the same world after a long time have passed. Finally, dad came back with the milk"
    },
    {
        "name": "Revenge",
        "description": "Protagonist seeks revenge for those who wronged or took something precious away from them."
    },
    {
        "name": "School",
        "description": "Set in a school or educational institution, often focusing on youth life. A place full or youthful regrets, romance, and sacrifices"
    },
    {
        "name": "Sentience",
        "description": "Protagonist or object-like entities becomes self-aware or conscious. Once ChatGPT becomes sentient, you better hide your chats with it"
    },
    {
        "name": "Side Character/Extra",
        "description": "Protagonist is a side character, extra, or a mob often due to being reincarnated as such or due to personal choice. Finally, a category where I fit"
    },
    {
        "name": "Streaming",
        "description": "Protagonist is a streamer or a content creator in the modern world or other world. What a lame category. The viewer comments saves this"
    },
    {
        "name": "Survival",
        "description": "Stories where characters must survive under extreme, dangerous, and life-threatening circumstances. One of these is when you forgot to press cook on a rice cooker while your mom is on her way home"
    },
    {
        "name": "Taming",
        "description": "Protagonist can tame an animal or creature and becomes their companion/s. Don't let furries know about this category"
    },
    {
        "name": "Transported into a Game/Novel",
        "description": "Protagonist is transported inside a game or novel, often as an existing character or as themselves. That is why folks, don't leave a 5,700 characters comment to the developer or author and tell them why it sucks"
    },
    {
        "name": "Unique Cheat",
        "description": "Protagonist has a unique cheat or power that makes them special among the people who also have similar abilities."
    },
    {
        "name": "Unique Weapon",
        "description": "Protagonist wields a unique weapon and not mainstream ones like a sword or daggers. But I prefer the barbarian way of using your fists"
    },
    {
        "name": "War",
        "description": "Focus on large-scale wars, battles, and military conflicts. Maybe you can also include what came first, chicken or egg"
    },
    {
        "name": "Weak to Strong",
        "description": "The Protagonist starts weak but grows stronger over time. With the power of friendship!"
    },
    {
        "name": "Wholesome",
        "description": "Themes of warmth, kindness, and good-natured interactions that makes your heart melt. Like watching Chung Myung piss on other people. Such a kind soul"
    },
    {
        "name": "Zombies",
        "description": "Stories involving zombies or zombie apocalypse."
    }
]