[
    {
        "current_chapter": 0,
        "reading_status": "not_read",
        "manhwa": {
            "id": 64,
            "name": "Ares",
            "synopsis": "The story takes place in an era similar to that of ancient Rome in a country called Chronos. It follows a group known as the Temple Mercenaries. In particular, the manhwa is about Ares, Michael and Baroona, three young warriors with mysterious pasts and surpassing skills...",
            "year_released": 2001,
            "chapters": "207",
            "chapter_min": 207,
            "chapter_max": null,
            "image_url": "https://cdn.myanimelist.net/images/manga/2/129069.jpg",
            "status": "Complete",
            "rating": "Highly Recommended",
            "genres": [
                "Action",
                "Adventure",
                "Drama",
                "Historical",
                "Shounen"
            ],
            "categories": [
                "Medieval",
                "Revenge",
                "War"
            ]
        }
    },
    {
        "current_chapter": 0,
        "reading_status": "not_read",
        "manhwa": {
            "id": 82,
            "name": "Banya: The Explosive Delivery Man",
            "synopsis": "With a worldwide war raging between humans and monsters, the young delivery men of the Gaya Desert Post Office do not pledge allegiance to any country or king. They are banded together by a pledge to deliver. Fast. Precise. Secure. Banya, the craziest and craftiest of the bunch, will stop at nothing to get a job done. Known as the Explosive Delivery Man for his risk taking, bold resolve, and impeccable record, Banya agrees to complete a wounded soldier's mission to transport a parcel of great importance–not knowing what dangers lie in store for him and his friends! As their arduous journey begins, Banya promises, \"There isn't a delivery I can't make. I always deliver.\"",
            "year_released": 2004,
            "chapters": "38",
            "chapter_min": 38,
            "chapter_max": null,
            "image_url": "https://cdn.myanimelist.net/images/manga/2/263641.jpg",
            "status": "Complete",
            "rating": "Good",
            "genres": [
                "Action",
                "Comedy",
                "Fantasy",
                "Shounen"
            ],
            "categories": [
                "Overpowered Protagonist"
            ]
        }
    },
    {
        "current_chapter": 0,
        "reading_status": "not_read",
        "manhwa": {
            "id": 153,
            "name": "Dangu",
            "synopsis": "From the desert wastelands emerge two mysterious warriors, master wizard Yarong and his faithful servant Batu. On a grave mission from their king, they have yet to realize the whirlwind of political movements and secret plots which will soon engulf them and change their lives forever. When Yarong is mortally injured, Batu must fulfill a secret promise to leave Yarong's side and protect his master's child. As Batu seeks to find and hide the infant, Yarong reveals another secret to those who have tracked him down to finish him off–the deadly, hidden power of a Shaman Warrior!",
            "year_released": 2003,
            "chapters": "43",
            "chapter_min": 43,
            "chapter_max": null,
            "image_url": "https://cdn.myanimelist.net/images/manga/3/302971.jpg",
            "status": "Axed",
            "rating": "Recommended",
            "genres": [
                "Action",
                "Adventure",
                "Drama",
                "Fantasy",
                "Martial Arts"
            ],
            "categories": [
                "Overpowered Protagonist",
                "Politics"
            ]
        }
    },
    {
        "current_chapter": 5,
        "reading_status": "planned",
        "manhwa": {
            "id": 155,
            "name": "Dark Mage",
            "synopsis": "Once... Humans and Orcs peacefully co-existed, but at some point humans got greedy and started a war claiming the Orcs' territory. The diety-Lord who created all, got angry with the humans' greed and decided to punish them with 3 catastrophes. One of them was the \"Dragons\", divine creatures blessed with magic capable of doing almost anything. Now the Orcs, with a \"Dragon\" by their side, seem to have the upper hand. Will humans just sit back and see their land get destroyed? They are too devious for that... Their only good plan at that point is to abduct a \"Dragon\" to even things up. But how are they going to manage the capture of a being with so much power?",
            "year_released": 2005,
            "chapters": "21",
            "chapter_min": 21,
            "chapter_max": null,
            "image_url": "https://cdn.myanimelist.net/images/manga/4/34917.jpg",
            "status": "Axed",
            "rating": "Good",
            "genres": [
                "Action",
                "Fantasy",
                "Historical",
                "Martial Arts",
                "Seinen"
            ],
            "categories": [
                "Medieval"
            ]
        }
    },
    {
        "current_chapter": 0,
        "reading_status": "not_read",
        "manhwa": {
            "id": 562,
            "name": "Player Kill",
            "synopsis": "Yonggi had sworn not to fight anymore since the death of his teacher. It doesnt stop him from protecting the weak while trying to hide his true strength. But when Gihoon, an old associate of Yonggi, drives him into the world of illegal prize-fighting, the young man will quickly be forced to review his principles...",
            "year_released": 2001,
            "chapters": "84",
            "chapter_min": 84,
            "chapter_max": null,
            "image_url": "https://cdn.myanimelist.net/images/manga/3/13107.jpg",
            "status": "Complete",
            "rating": "Good",
            "genres": [
                "Action",
                "Martial Arts",
                "Shounen"
            ],
            "categories": [
                "Friendship",
                "Overpowered Protagonist",
                "Revenge"
            ]
        }
    },
    {
        "current_chapter": 0,
        "reading_status": "not_read",
        "manhwa": {
            "id": 586,
            "name": "Rebirth",
            "synopsis": "Three hundred years ago the Dark Magician Deshwitat Lived Rudbich, a vampire, was sealed in limbo by the Light Magician Kalutika. Resurrected in the present day, Deshwitat has vowed to destroy Kalutika, and now, with the help of a team of spiritual warriors, seeks the means to use Light Magic to achieve his ends.",
            "year_released": 1998,
            "chapters": "93",
            "chapter_min": 93,
            "chapter_max": null,
            "image_url": "https://cdn.myanimelist.net/images/manga/2/3578.webp",
            "status": "Complete",
            "rating": "Recommended",
            "genres": [
                "Action",
                "Adventure",
                "Drama",
                "Fantasy",
                "Romance",
                "Seinen",
                "Supernatural",
                "Tragedy"
            ],
            "categories": [
                "Medieval",
                "Revenge",
                "War"
            ]
        }
    },
    {
        "current_chapter": 0,
        "reading_status": "not_read",
        "manhwa": {
            "id": 637,
            "name": "Ruler of the Land",
            "synopsis": "Bi-Kwang is a dashing young warrior who turns into a bumbling fool whenever he lays eyes on an attractive girl. While travelling, he encounters an exceptional swordfighter without a name who is on a quest to find a renowned master warrior. Bi-Kwang offers to assist the swordfighter on the condition that he introduces Bi-Kwang to his enchanting sister. Unbeknownst to him, the swordfighter is actually the sister, Hwa-Rin Dahm, who must assume different identities to advance the story. Bi-Kwang is instantly captivated, leading to a peculiar love triangle that involves only two individuals.",
            "year_released": 1995,
            "chapters": "More than 100",
            "chapter_min": 100,
            "chapter_max": null,
            "image_url": "placeholder_url",
            "status": "Ongoing",
            "rating": "Recommended",
            "genres": [
                "Action",
                "Adventure",
                "Comedy",
                "Drama",
                "Fantasy",
                "Martial Arts",
                "Romance",
                "Shounen"
            ],
            "categories": [
                "Murim",
                "Overpowered Protagonist"
            ]
        }
    },
    {
        "current_chapter": 0,
        "reading_status": "not_read",
        "manhwa": {
            "id": 885,
            "name": "Threads of Time",
            "synopsis": "High school student Moon Bin Lee has difficulty sleeping due to a recurring nightmare: he's stranded over a thousand years in the past chasing a dark-haired girl into a deep abyss.\r\n\r\nBefore long, the nightmare overwhelms him, and he is unable to tell whether he is Moon Bin, a Seoul teenager at the end of the second Millennium, or Sa Kyoung Kim, the son of a prominent warrior family in the middle of the first Millennium. People in his present-day life assume roles in his historical life as he struggles to learn exactly who he is and what he's expected to do, straddling a transmigratory portal through time and space.\r\n\r\nIn the present, his school's kendo club battles to stay in the championships… but in the past, Moon Bin finds himself at the threshold of a territorial dispute on the plains of Mongolia.",
            "year_released": 1999,
            "chapters": "46",
            "chapter_min": 46,
            "chapter_max": null,
            "image_url": "https://cdn.myanimelist.net/images/manga/2/222997.webp",
            "status": "Complete",
            "rating": "Highly Recommended",
            "genres": [
                "Action",
                "Adventure",
                "Drama",
                "Historical",
                "Romance",
                "Seinen",
                "Tragedy"
            ],
            "categories": [
                "Reincarnation",
                "War"
            ]
        }
    },
    {
        "current_chapter": 0,
        "reading_status": "not_read",
        "manhwa": {
            "id": 938,
            "name": "Veritas",
            "synopsis": "Gangryong is a high schooler unlike others. He has always had a dream of being the strongest. One day he meets Youcheon, who teaches him a powerful skill. One year later, people come to see him and announce that his \"master\" is dead. Because he was his only student, Gangryong has to follow them and go to a school where everybody has supernatural powers to fight.",
            "year_released": 2005,
            "chapters": "81",
            "chapter_min": 81,
            "chapter_max": null,
            "image_url": "https://cdn.myanimelist.net/images/manga/1/55069.webp",
            "status": "Axed",
            "rating": "Recommended",
            "genres": [
                "Action",
                "Comedy",
                "Drama",
                "Martial Arts",
                "School Life",
                "Shounen",
                "Supernatural"
            ],
            "categories": [
                "Academy",
                "Revenge"
            ]
        }
    },
    {
        "current_chapter": 0,
        "reading_status": "not_read",
        "manhwa": {
            "id": 988,
            "name": "Yongbi",
            "synopsis": "Yongbi is a bounty hunter without fear or reproach. Especially without fear, actually. Despite his greed and his penchant for drinking (fortunately shared by his faithful horse) and women, Yongbi is still a charming young man. And when a boy carrying a medallion, source of much envy, finds himself under the protection of the adventurer, those who cross their path must prepare for the worst!",
            "year_released": 1998,
            "chapters": "149",
            "chapter_min": 149,
            "chapter_max": null,
            "image_url": "https://cdn.myanimelist.net/images/manga/1/88293.webp",
            "status": "Complete",
            "rating": "Highly Recommended",
            "genres": [
                "Action",
                "Adventure",
                "Comedy",
                "Historical",
                "Martial Arts",
                "Shounen"
            ],
            "categories": [
                "Murim",
                "Overpowered Protagonist",
                "Unique Weapon"
            ]
        }
    },
    {
        "current_chapter": 0,
        "reading_status": "not_read",
        "manhwa": {
            "id": 994,
            "name": "Zippy Ziggy",
            "synopsis": "Reputation is everything in a world of icons and popularity contests. So why not score some points here and there by being the nice guy? This is the way Kang Shin-gi legitimizes the fake personality he has everyone believing. Armed with his above average looks and a (completely false) angel-like personality, he has every girl in school head over heels, and all the guys looking to him for guidance. With the exception of having a screwed up cross-dressing devil for a dad, Shin-gi’s life is absolute perfection (cough of lies), until one day, Um Seung-hui transfers to his school.\r\n\r\nWhile being a complete martial artist freak, she also likes to fib just a little in front of those who know her… you know, like acting like she's just a scared little girl who'd play with kittens rather than break brick walls with her head! After all, how can anything go wrong when you're as cute as Seung-hui?\r\n\r\nFate has brought these two masters of lies together, and the two must battle it out to see who will be crowned the undefeated heavy-weight champion of fakeness!",
            "year_released": 2004,
            "chapters": "86",
            "chapter_min": 86,
            "chapter_max": null,
            "image_url": "https://cdn.myanimelist.net/images/manga/2/317011.webp",
            "status": "Complete",
            "rating": "Good",
            "genres": [
                "Action",
                "Comedy",
                "Martial Arts",
                "Romance",
                "School Life",
                "Shounen"
            ],
            "categories": [
                "Misunderstanding",
                "School"
            ]
        }
    }
]